ubirch/ubirch-kinetis-sdk/SDK_2.1_MK82FN256xxx15/middleware/emv_2.0.2/inc/emvl1_adapter_sdk.h
#if defined(USING_PHY_GPIO)
#define SMARTCARD_PHY_ACTIVATE(context, resetType)                               \
    SMARTCARD_PHY_GPIO_Activate(((smartcard_context_t *)context)->base, context, \
                                resetType) /*!< Common Smart card API macro */
#define SMARTCARD_PHY_DEACTIVATE(context) \
    SMARTCARD_PHY_GPIO_Deactivate(((smartcard_context_t *)context)->base, context) /*!< Common Smart card API macro */
#define SMARTCARD_PHY_CONTROL(context, control, param)                                   \
    SMARTCARD_PHY_GPIO_Control(((smartcard_context_t *)context)->base, context, control, \
                               param) /*!< Common Smart card API macro */
#define SMARTCARD_PHY_INIT(base, config, sourceClockHz) \
    SMARTCARD_PHY_GPIO_Init(base, config, sourceClockHz)                           /*!< Common Smart card API macro */
#define SMARTCARD_PHY_DEINIT(base, config) SMARTCARD_PHY_GPIO_Deinit(base, config) /*!< Common Smart card API macro */
#define SMARTCARD_PHY_GET_DEFAULT_CONFIG(config) \
    SMARTCARD_PHY_GPIO_GetDefaultConfig(config) /*!< Common Smart card API macro */
#endif                                          /* defined(USING_PHY_GPIO) */
#endif                                          /* USE_RTOS */

//${macro:end}
/*******************************************************************************
* API
******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*! @}*/
#if defined(__cplusplus)
}
#endif
/*! @}*/
#endif /* _EMVL1_ADAPTER_SDK_H_ */
